# Occupation

### Introduction:

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [122]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users.

In [2]:
path = 'D:/ML/Books/Learning_Pandas_russian_translation-1-master/pandas_exercises-master/pandas_exercises-master/Data/users.csv'
data = pd.read_csv(path,sep='|')
data.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### Step 4. Discover what is the mean age per occupation

In [11]:
group = data.groupby('occupation')
np.round(group['age'].mean(),0)

occupation
administrator    39.0
artist           31.0
doctor           44.0
educator         42.0
engineer         36.0
entertainment    29.0
executive        39.0
healthcare       42.0
homemaker        33.0
lawyer           37.0
librarian        40.0
marketing        38.0
none             27.0
other            35.0
programmer       33.0
retired          63.0
salesman         36.0
scientist        36.0
student          22.0
technician       33.0
writer           36.0
Name: age, dtype: float64

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [196]:
# My idea
men_occupation = data[data['gender'] == 'M'].groupby('occupation').count()
total_occcupation = data.groupby('occupation').count()

men_ration = np.round((men_occupation/total_occcupation)['gender'].values,2)
res_df = pd.DataFrame({'occupation':men_occupation.index.values,
                           'men_ratio':men_ration})
res_df.sort_values('men_ratio',ascending=False)
#plt.figure(figsize=(10,10))
#res_df.plot(kind='bar')

# Author's solution

def gender_encoding(val):
    if val == 'M':
        return 1
    elif val == 'F':
        return 0
    
data['gender_encoded'] = data['gender'].apply(gender_encoding)

men = data.groupby('occupation')['gender_encoded'].sum()
total = data['occupation'].value_counts()

res = np.round((men/total),3)*100
res.sort_values(ascending=False)

doctor           100.0
engineer          97.0
technician        96.3
retired           92.9
programmer        90.9
executive         90.6
scientist         90.3
entertainment     88.9
lawyer            83.3
salesman          75.0
educator          72.6
student           69.4
other             65.7
marketing         61.5
writer            57.8
none              55.6
administrator     54.4
artist            53.6
librarian         43.1
healthcare        31.2
homemaker         14.3
dtype: float64

### Step 6. For each occupation, calculate the minimum and maximum ages

In [133]:
group = data.groupby('occupation')
group['age'].agg(['min','max'])

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70
entertainment   15   50
executive       22   69
healthcare      22   62
homemaker       20   50
lawyer          21   53
librarian       23   69
marketing       24   55
none            11   55
other           13   64
programmer      20   63
retired         51   73
salesman        18   66
scientist       23   55
student          7   42
technician      21   55
writer          18   60

### Step 7. For each combination of occupation and gender, calculate the mean age

In [150]:
group = data.groupby(['occupation','gender'])
(np.round(group['age'].mean(),0))

occupation     gender
administrator  F         41.0
               M         37.0
artist         F         30.0
               M         32.0
doctor         M         44.0
educator       F         39.0
               M         43.0
engineer       F         30.0
               M         37.0
entertainment  F         31.0
               M         29.0
executive      F         44.0
               M         38.0
healthcare     F         40.0
               M         45.0
homemaker      F         34.0
               M         23.0
lawyer         F         40.0
               M         36.0
librarian      F         40.0
               M         40.0
marketing      F         37.0
               M         38.0
none           F         36.0
               M         19.0
other          F         35.0
               M         34.0
programmer     F         32.0
               M         33.0
retired        F         70.0
               M         63.0
salesman       F         27.0
               M         39.0
scientist      F         28.0
               M         36.0
student        F         21.0
               M         23.0
technician     F         38.0
               M         33.0
writer         F         38.0
               M         35.0
Name: age, dtype: float64

### Step 8.  For each occupation present the percentage of women and men

In [212]:
# My idea
men = data[data['gender'] == 'M'].groupby('occupation')['gender'].count()
women = data[data['gender'] == 'F'].groupby('occupation')['gender'].count()
total = data.groupby('occupation')['gender'].count()

men_perc = np.round((men/total),2)
women_per = np.round((women/total),2)

res_df = pd.DataFrame({'men_%':men_perc,'women_%':women_per})
res_df.sort_values(by=['men_%','women_%'],ascending=False)

# Author's idea
occup_per_gender = data.groupby(['occupation','gender']).agg({'gender':'count'})
total_occup = data.groupby('occupation').agg('count')
res = np.round(occup_per_gender.div(total_occcupation,level = 'occupation'),3)*100
res['gender']

occupation     gender
administrator  F          45.6
               M          54.4
artist         F          46.4
               M          53.6
doctor         M         100.0
educator       F          27.4
               M          72.6
engineer       F           3.0
               M          97.0
entertainment  F          11.1
               M          88.9
executive      F           9.4
               M          90.6
healthcare     F          68.8
               M          31.2
homemaker      F          85.7
               M          14.3
lawyer         F          16.7
               M          83.3
librarian      F          56.9
               M          43.1
marketing      F          38.5
               M          61.5
none           F          44.4
               M          55.6
other          F          34.3
               M          65.7
programmer     F           9.1
               M          90.9
retired        F           7.1
               M          92.9
salesman       F          25.0
               M          75.0
scientist      F           9.7
               M          90.3
student        F          30.6
               M          69.4
technician     F           3.7
               M          96.3
writer         F          42.2
               M          57.8
Name: gender, dtype: float64